app/Controllers/Admins/AdminsController.php

SELECT *
FROM `categories`
ORDER BY `id` ASC
---
    public function allcategory()
    {
        $session = session();
        $categories = new Category();
        $allcategories = $categories->select('*')->orderBy('id', 'ASC')->get()->getResult();

DELETE FROM `categories`
WHERE `id` IN ('9')
---
    public function deletecategory($id){

        $categories = new Category();
        $categories->delete($id);

SELECT *
FROM `posts`
ORDER BY `id` ASC
---
    public function allposts(){
        $session = session();
        $posts = new Post();
        $allposts = $posts->select('*')->orderBy('id', 'ASC')->get()->getResult();

SELECT *
FROM `posts`
WHERE `posts`.`id` = '9'
DELETE FROM `posts`
WHERE `id` IN ('9')
---
    public function deletepost($id){
        $posts = new Post();

        $post = $posts->find($id);
        unlink('public/assets/images/'.$post['image'].'');

        $posts->delete($id);